//Задание 5
Console.Write("Введите число: ");
int num = Convert.ToInt32(Console.ReadLine());
if(num % 10 == 7)
{
    Console.WriteLine("Оканчивается на 7");
}
else
{
    Console.WriteLine("Не оканчивается на 7");
}